{
  "name": "Ossiarch Bonereapers",
  "spells": [
    {
      "name": "Empower Nadirite Weapons",
      "description": "Empower Nadirite Weapons is a spell that has a casting value of 5 and a range of 24\". If successfully cast, pick 1 friendly OSSIARCH BONEREAPERS unit wholly within range and visible to the caster. Until the start of your next hero phase, the Nadirite Weapons battle trait triggers on an unmodified hit roll of 5+ instead of 6 for that unit."
    },
    {
      "name": "Protection of Nagash",
      "description": "Protection of Nagash is a spell that has a casting value of 6. If successfully cast, at the end of any phase, if any wounds or mortal wounds were allocated to the caster in that phase from an attack made with a melee weapon and the caster was not slain, remove them from the battlefield and set them up again on the battlefield more than 9\" from all enemy units. After setting up the caster, this spell is unbound."
    },
    {
      "name": "Reinforce Constructs",
      "description": "Reinforce Constructs is a spell that has a casting value of 5 and a range of 18\". If successfully cast, pick 1 friendly OSSIARCH BONEREAPERS unit wholly within range and visible to the caster. Until your next hero phase, that unit has a ward of 4+ against mortal wounds."
    },
    {
      "name": "Drain Vitality",
      "description": "Drain Vitality is a spell that has a casting value of 6 and a range of 18\". If successfully cast, pick 1 enemy unit within range and visible to the caster. Until your next hero phase, subtract 1 from hit rolls for attacks made by that unit and subtract 1 from save rolls for attacks that target that unit."
    },
    {
      "name": "Mortal Contract",
      "description": "Mortal Contract is a spell that has a casting value of 7 and a range of 18\". If successfully cast, pick 1 enemy unit within range and visible to the caster. For the rest of the battle, roll a dice at the end of each phase in which any attacks made by that unit inflicted any damage on a friendly OSSIARCH BONEREAPERS unit. On a 3+, that enemy unit suffers D3 mortal wounds. You cannot pick the same enemy unit to be affected by this spell more than once per battle."
    },
    {
      "name": "Soul Release",
      "description": "Soul Release is a spell that has a casting value of 5 and a range of 12\". If successfully cast, until your next hero phase, enemy reserve units and enemy summoned units (core rules, 3.1) cannot be set up within range of the caster. The range of this spell cannot be modified and must be measured from the caster, even if an ability would allow you to measure it from elsewhere."
    }
  ],
  "grandStrategies": [
    {
      "name": "The Scales Balanced",
      "description": "When the battle ends, you complete this grand strategy if any friendly MORTEK GUARD or KAVALOS DEATHRIDERS units from your starting army have the same number of models as they had at the start of the battle."
    },
    {
      "name": "A Textbook Conquest",
      "description": "When the battle ends, you complete this grand strategy if you control all of the objectives on the battlefield."
    },
    {
      "name": "Creation and Termination",
      "description": "When the battle ends, you complete this grand strategy if there are more friendly MORTISANS than enemy HEROES on the battlefield."
    },
    {
      "name": "The Pride of Ossia",
      "description": "When the battle ends, you complete this grand strategy if you completed at least 4 battle tactics and every battle tactic you completed this battle was from the 'Flawless Executions' list."
    }
  ],
  "battleTactics": [
    {
      "name": "Trample the Defiant",
      "description": "Pick 1 friendly KAVALOS DEATHRIDERS unit that is more than 3\" from all enemy units. You complete this tactic if that unit made a charge move in this turn and is within 3\" of any enemy units at the end of this turn."
    },
    {
      "name": "The Sculptor's Entourage",
      "description": "You complete this tactic at the end of this turn if a friendly IMMORTIS GUARD unit and a friendly MORTISAN are contesting the same objective wholly outside of your territory."
    },
    {
      "name": "Remorseless Bombardment",
      "description": "Pick 1 enemy unit on the battlefield. You complete this tactic if that enemy unit is destroyed during this turn by attacks made by friendly MORTEK CRAWLER units."
    },
    {
      "name": "The Tithe Demands",
      "description": "Pick 1 enemy HERO or MONSTER on the battlefield. You complete this tactic if that unit is destroyed during this turn by an attack made by a friendly GOTHIZZAR HARVESTER."
    },
    {
      "name": "The Edge of Obliteration",
      "description": "You complete this tactic if 2 or more friendly NECROPOLIS STALKERS units are wholly within enemy territory and more than 9\" from all enemy units at the end of this turn."
    },
    {
      "name": "Unfeeling Recursion",
      "description": "You complete this tactic if there are 3 or more friendly OSSIARCH BONEREAPERS units on the battlefield that had models returned to them in this turn using the Reknit Construct command ability and did not have any models slain in this turn."
    }
  ],
  "commandAbilities": [
    {
      "name": "Re-form Ranks",
      "description": "You can use this command ability in your movement phase. The unit that receives the command must be a friendly OSSIARCH BONEREAPERS unit. That unit can retreat in that phase and still charge later in the turn.",
      "phase": ["movement"],
      "turn": "mine"
    },
    {
      "name": "Unstoppable Advance",
      "description": "You can use this command ability in your movement phase when you pick a friendly OSSIARCH BONEREAPERS unit to make a normal move. Add 3\" to that unit's Move characteristic until the end of that phase.",
      "phase": ["movement"],
      "turn": "mine"
    },
    {
      "name": "Reknit Construct",
      "description": "You can use this command ability at the end of your movement phase. The unit that receives the command must be a friendly OSSIARCH BONEREAPERS unit that is more than 3\" from all enemy units. You can heal up to D3 wounds allocated to that unit or, if no wounds are allocated to it, you can return a number of slain models to that unit that have a combined Wounds characteristic of D3 or less.",
      "phase": ["movement"],
      "turn": "mine"
    },
    {
      "name": "Counter-strike",
      "description": "You can use this command ability in the enemy charge phase, after an enemy unit has finished a charge move. The unit that receives the command must be a friendly OSSIARCH BONEREAPERS unit that is within 3\" of an enemy unit that made a charge move in the same turn and more than 3\" from all other enemy units. Add 1 to wound rolls for attacks made with melee weapons by that unit in the following combat phase.",
      "phase": ["charge"],
      "turn": "opponent"
    },
    {
      "name": "Impenetrable Ranks",
      "description": "You can use this command ability when a friendly OSSIARCH BONEREAPERS unit is picked as the target of an attack. That unit must receive the command. Until the end of the phase, add 1 to ward rolls for that unit for the purposes of the Deathless Warriors battle trait.",
      "phase": ["shooting", "combat"],
      "turn": "independent"
    },
    {
      "name": "Bludgeon",
      "description": "You can use this command ability at the start of the combat phase. The unit that receives the command must be a friendly OSSIARCH BONEREAPERS unit. Improve the Rend characteristic of that unit's melee weapons by 1 until the end of that phase.",
      "phase": ["combat"],
      "turn": "independent"
    },
    {
      "name": "Unflinching Coordination",
      "description": "You can use this command ability in the combat phase, after a friendly OSSIARCH BONEREAPERS HERO has fought for the first time in that phase. The unit that receives the command must be a friendly OSSIARCH BONEREAPERS unit that has not yet fought in that combat phase, that is within 3\" of an enemy unit and that is wholly within 12\" of that friendly OSSIARCH BONEREAPERS HERO. That unit fights immediately.",
      "phase": ["combat"],
      "turn": "independent"
    }
  ]
}
